; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	infrared4 - mode
	image0 - mode
	spectrograph3 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared4)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared4)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument7 infrared1)
	(supports instrument7 infrared4)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared4)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star0)
	(supports instrument9 infrared1)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 spectrograph3)
	(supports instrument10 infrared4)
	(calibration_target instrument10 Star4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
	(supports instrument11 image0)
	(supports instrument11 infrared4)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 image0)
	(calibration_target instrument12 Star4)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite4 Star9)
	(have_image Phenomenon5 spectrograph3)
	(have_image Phenomenon6 spectrograph3)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 infrared4)
	(have_image Star9 spectrograph3)
	(have_image Star10 infrared4)
))

)

; plan
1. (turn_to satellite4 star4 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star4)
   goals met: 0 of 8
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 8
3. (calibrate satellite4 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 0 of 8
4. (turn_to satellite4 phenomenon6 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 phenomenon6)
   goals met: 0 of 8
5. (take_image satellite4 phenomenon6 instrument10 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 1 of 8
6. (turn_to satellite4 phenomenon5 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 8
7. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 2 of 8
8. (take_image satellite4 phenomenon5 instrument10 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 3 of 8
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 8
10. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 3 of 8
11. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 8
12. (take_image satellite1 phenomenon7 instrument2 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 8
13. (turn_to satellite4 phenomenon8 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon8)
   goals met: 4 of 8
14. (take_image satellite4 phenomenon8 instrument10 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 5 of 8
15. (turn_to satellite4 star10 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star10)
   goals met: 5 of 8
16. (take_image satellite4 star10 instrument10 infrared4)
   added: (have_image star10 infrared4)
   goals met: 6 of 8
17. (turn_to satellite4 star9 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star9)
   goals met: 7 of 8
18. (take_image satellite4 star9 instrument10 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 8 of 8
